---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.Dispose
source: html/cb49dce2-1933-9603-57e9-0c23a4ed613c.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.Dispose Method

Releases all resources used by the AnalysisDisplayColorSettings

## Syntax (C#)
```csharp
public void Dispose()
```